#### SpacingRuleJustification Enumeration

---

|  |
| --- |
| See Also |

Justification property of spacing rule

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum SpacingRuleJustification ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration SpacingRuleJustification ``` |

| Visual C++ |
| --- |
| ``` public enum class SpacingRuleJustification ``` |

# Members

| Member name | Description |
| --- | --- |
| Center |  |
| Beginning |  |
| End |  |

# See Also

Autodesk.Revit.DB Namespace